# Exporter IFC Add Building Storey Method

Source: https://www.revitapidocs.com/2026/08c5605c-b66f-baae-5684-d9dc7cf7121a.htm

---

| Exporter IFC Add Building Storey Method |
| --- |

**Note: This API is now obsolete.**

Adds building storey to the exporter's internal cache.
**Namespace:** Autodesk.Revit.DB.IFC
**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById instead.")]
public void AddBuildingStorey(
	ElementId id,
	IFCLevelInfo levelInfo
)
```

```
<ObsoleteAttribute("This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById instead.")>
Public Sub AddBuildingStorey (
	id As ElementId,
	levelInfo As IFCLevelInfo
)
```

```
public:
[ObsoleteAttribute(L"This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById instead.")]
void AddBuildingStorey(
	ElementId^ id,
	IFCLevelInfo^ levelInfo
)
```

```
[<ObsoleteAttribute("This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById instead.")>]
member AddBuildingStorey :
        id : ElementId *
        levelInfo : IFCLevelInfo -> unit
```

#### Parameters

id ElementId
:   The level id.

levelInfo IFCLevelInfo
:   The IFCLevelInfo object.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

ExporterIFC Class Autodesk.Revit.DB.IFC Namespace